[
  {
    "guid": "https://warontherocks.com/?p=42334",
    "title": "Decline of Operational Art: The Story of A Strategic China Wargame",
    "description": "<p>Planners today struggle to properly apply operational art in large scale war &#8212; and they don&#8217;t fully realize why. It takes something like firsthand experience in a strategic level wargame against a human red team to fully realize how much understanding of classical military art has been lost.The 21st century has witnessed the resurgence of great-power competition, with the Indo-Pacific theater emerging as a focal point for geopolitical rivalry between the United States and China. The increasing complexity of warfare, characterized by rapid technological advancements and emerging multi-domain operations, places unprecedented demands on military planners and strategists. Central to meeting</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/decline-of-operational-art-story-of-a-strategic-china-wargame/\">Decline of Operational Art: The Story of A Strategic China Wargame</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/decline-of-operational-art-story-of-a-strategic-china-wargame/",
    "publishedAt": "Fri, 12 Dec 2025 08:30:25 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Planners today struggle to properly apply operational art in large scale war — and they don’t fully realize why. It takes something like firsthand experience in a strategic level wargame against a human red team to fully realize how much understanding of classical military art has been lost.The 21st century has witnessed the resurgence of great-power competition, with the Indo-Pacific theater emerging as a focal point for geopolitical rivalry between the United States and China. The increasing complexity of warfare, characterized by rapid technological advancements and emerging multi-domain operations, places unprecedented demands on military planners and strategists. Central to meeting\nThe post Decline of Operational Art: The Story of A Strategic China Wargame appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42360",
    "title": "Getting Faster, Stronger, Ready: Sweden’s Defense Minister on Reform and Resolve",
    "description": "<p>Since joining NATO in 2024, Sweden has taken on a more prominent role in European security. Swedish Defense Minister P&#229;l Jonson joined Ryan in Washington to discuss how Sweden is supporting Ukraine, rebuilding its own military with more resources, and pushing for a faster, more agile defense acquisition system.Image: Lance Cpl. Frank Sepulveda Torres via DVIDS</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/getting-faster-stronger-ready-swedens-defense-minister-on-reform-and-resolve/\">Getting Faster, Stronger, Ready: Sweden’s Defense Minister on Reform and Resolve</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/getting-faster-stronger-ready-swedens-defense-minister-on-reform-and-resolve/",
    "publishedAt": "Thu, 11 Dec 2025 20:26:07 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Since joining NATO in 2024, Sweden has taken on a more prominent role in European security. Swedish Defense Minister Pål Jonson joined Ryan in Washington to discuss how Sweden is supporting Ukraine, rebuilding its own military with more resources, and pushing for a faster, more agile defense acquisition system.Image: Lance Cpl. Frank Sepulveda Torres via DVIDS\nThe post Getting Faster, Stronger, Ready: Sweden’s Defense Minister on Reform and Resolve appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42345",
    "title": "The Additive Manufacturing Mirage in Defense",
    "description": "<p>Editor&#8217;s note: This is the first article in a two-part series exploring additive manufacturing.The Pentagon has poured unprecedented funds into additive manufacturing as a potential game-changer for defense production. For example, in fiscal year 2024, the Department of Defense allocated roughly $800 million for additive, which was a 166% increase from the prior year. By FY2026, projects involving 3D printing will swell to an estimated $3.3 billion, based on the budget request. That may sound enormous, but it is still only a small fraction of a research, development, test, and evaluation budget north of $100 billion. The appeal makes sense</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/the-additive-manufacturing-mirage-in-defense/\">The Additive Manufacturing Mirage in Defense</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/the-additive-manufacturing-mirage-in-defense/",
    "publishedAt": "Thu, 11 Dec 2025 09:00:49 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Editor’s note: This is the first article in a two-part series exploring additive manufacturing.The Pentagon has poured unprecedented funds into additive manufacturing as a potential game-changer for defense production. For example, in fiscal year 2024, the Department of Defense allocated roughly $800 million for additive, which was a 166% increase from the prior year. By FY2026, projects involving 3D printing will swell to an estimated $3.3 billion, based on the budget request. That may sound enormous, but it is still only a small fraction of a research, development, test, and evaluation budget north of $100 billion. The appeal makes sense\nThe post The Additive Manufacturing Mirage in Defense appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42293",
    "title": "Do China’s Foreign Policy Experts Matter? How?",
    "description": "<p>Foreign policy communities in open societies love to debate their own relevance. Analysts quarrel over whether their insights inform statecraft or merely decorate it, and governments alternately embrace and ignore them depending on the moment. One might assume that in China this dynamic hardly exists, that an authoritarian system simply compels its experts to fall in line and rewards those who echo the leadership&#8217;s priorities.The reality is more complicated. China&#8217;s foreign policy experts neither operate in lockstep with the state nor stand wholly apart from it. As I discuss in my new book, their influence rises and falls with their</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/do-chinas-foreign-policy-experts-matter-how/\">Do China’s Foreign Policy Experts Matter? How?</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/do-chinas-foreign-policy-experts-matter-how/",
    "publishedAt": "Wed, 10 Dec 2025 08:30:46 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Foreign policy communities in open societies love to debate their own relevance. Analysts quarrel over whether their insights inform statecraft or merely decorate it, and governments alternately embrace and ignore them depending on the moment. One might assume that in China this dynamic hardly exists, that an authoritarian system simply compels its experts to fall in line and rewards those who echo the leadership’s priorities.The reality is more complicated. China’s foreign policy experts neither operate in lockstep with the state nor stand wholly apart from it. As I discuss in my new book, their influence rises and falls with their\nThe post Do China’s Foreign Policy Experts Matter? How? appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42277",
    "title": "Why Many Underestimated Russia’s Invasion Risk",
    "description": "<p>Why did so many downplay the risk of a Russian full-scale invasion of Ukraine in February 2022 despite mounting indicators, such as troop build-ups, major exercises, and increasingly aggressive rhetoric from Moscow?Even hours before the first strikes, major media outlets argued that an invasion was unlikely, as it seemed to contradict President Vladimir Putin&#8217;s cost-benefit calculus. They assumed he would conclude that the costs of heavy Western sanctions, together with the risk of significant battlefield casualties, outweighed the potential gains.Many analysts and observers underestimated the likelihood of invasion in part because they modeled Russia as a typical state in which</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/why-many-underestimated-russias-invasion-risk/\">Why Many Underestimated Russia’s Invasion Risk</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/why-many-underestimated-russias-invasion-risk/",
    "publishedAt": "Mon, 08 Dec 2025 08:30:59 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Why did so many downplay the risk of a Russian full-scale invasion of Ukraine in February 2022 despite mounting indicators, such as troop build-ups, major exercises, and increasingly aggressive rhetoric from Moscow?Even hours before the first strikes, major media outlets argued that an invasion was unlikely, as it seemed to contradict President Vladimir Putin’s cost-benefit calculus. They assumed he would conclude that the costs of heavy Western sanctions, together with the risk of significant battlefield casualties, outweighed the potential gains.Many analysts and observers underestimated the likelihood of invasion in part because they modeled Russia as a typical state in which\nThe post Why Many Underestimated Russia’s Invasion Risk appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42287",
    "title": "The U.S.-Saudi Reconfiguration Is Real and It No Longer Depends on Israel",
    "description": "<p>Saudi Crown Prince Mohammed bin Salman&#8217;s recent White House visit has crystallized a fundamental shift in U.S.-Saudi relations: Washington no longer has the leverage to demand Saudi normalization with Israel.After the Biden administration distanced itself from Riyadh following the 2018 Jamal Khashoggi killing, Washington has now recalibrated. This was driven not by diplomacy or values alignment but by structural pressures, including the political blowback that Washington has faced for its military and diplomatic support for Israel&#8217;s Gaza campaign, which strained U.S. credibility across the region. Key to these structural pressures were supply-chain vulnerabilities exposed during the COVID-19 pandemic, the shock</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/the-u-s-saudi-reconfiguration-is-real-and-it-no-longer-depends-on-israel/\">The U.S.-Saudi Reconfiguration Is Real and It No Longer Depends on Israel</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/the-u-s-saudi-reconfiguration-is-real-and-it-no-longer-depends-on-israel/",
    "publishedAt": "Fri, 05 Dec 2025 08:30:13 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Saudi Crown Prince Mohammed bin Salman’s recent White House visit has crystallized a fundamental shift in U.S.-Saudi relations: Washington no longer has the leverage to demand Saudi normalization with Israel.After the Biden administration distanced itself from Riyadh following the 2018 Jamal Khashoggi killing, Washington has now recalibrated. This was driven not by diplomacy or values alignment but by structural pressures, including the political blowback that Washington has faced for its military and diplomatic support for Israel’s Gaza campaign, which strained U.S. credibility across the region. Key to these structural pressures were supply-chain vulnerabilities exposed during the COVID-19 pandemic, the shock\nThe post The U.S.-Saudi Reconfiguration Is Real and It No Longer Depends on Israel appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42245",
    "title": "Decades of Lost Potential in Defense Research and Development",
    "description": "<p>America&#8217;s greatest national security threat is an enemy born from and nurtured by the Pentagon: crippling bureaucracy. It starves the oxygen from good ideas, good people, and good technologies while creating ideal conditions for mediocrity to thrive. It has permeated every corner of the system, including the defense-sponsored innovation initiatives &#8212; like the Small Business Innovation Research Program &#8212; that purportedly exist as its counter.In 1982, President Ronald Reagan signed the Small Business Innovation Development Act, creating the Small Business Innovation Research program. Its stated objectives include providing American small businesses with non-dilutive funding for research and development in areas</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/decades-of-lost-potential-in-defense-research-and-development/\">Decades of Lost Potential in Defense Research and Development</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/decades-of-lost-potential-in-defense-research-and-development/",
    "publishedAt": "Thu, 04 Dec 2025 08:25:49 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "America’s greatest national security threat is an enemy born from and nurtured by the Pentagon: crippling bureaucracy. It starves the oxygen from good ideas, good people, and good technologies while creating ideal conditions for mediocrity to thrive. It has permeated every corner of the system, including the defense-sponsored innovation initiatives — like the Small Business Innovation Research Program — that purportedly exist as its counter.In 1982, President Ronald Reagan signed the Small Business Innovation Development Act, creating the Small Business Innovation Research program. Its stated objectives include providing American small businesses with non-dilutive funding for research and development in areas\nThe post Decades of Lost Potential in Defense Research and Development appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42222",
    "title": "Europe’s New Lines of Defense Are Not Maginot 2.0",
    "description": "<p>Across Europe, nations have signaled a desire to dig, wire, and network their frontiers. From the Baltic Defense Line and the European Union&#8217;s proposed &#8220;drone wall&#8221; to Finland&#8217;s pilot barriers and Poland&#8217;s East Shield, the continent has embarked upon its most significant defensive hardening since the Cold War. Rather than nostalgia for the trenches, this effort represents a calculated adaptation to the war in Ukraine, one designed to ensure aggression is neither quick nor cheap.That strategic shift began at NATO&#8217;s Madrid Summit in 2022, when the alliance moved from deterrence by punishment to deterrence by denial. The old idea accepted</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/europes-new-lines-of-defense-are-not-maginot-2-0/\">Europe’s New Lines of Defense Are Not Maginot 2.0</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/europes-new-lines-of-defense-are-not-maginot-2-0/",
    "publishedAt": "Wed, 03 Dec 2025 08:30:48 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Across Europe, nations have signaled a desire to dig, wire, and network their frontiers. From the Baltic Defense Line and the European Union’s proposed “drone wall” to Finland’s pilot barriers and Poland’s East Shield, the continent has embarked upon its most significant defensive hardening since the Cold War. Rather than nostalgia for the trenches, this effort represents a calculated adaptation to the war in Ukraine, one designed to ensure aggression is neither quick nor cheap.That strategic shift began at NATO’s Madrid Summit in 2022, when the alliance moved from deterrence by punishment to deterrence by denial. The old idea accepted\nThe post Europe’s New Lines of Defense Are Not Maginot 2.0 appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42239",
    "title": "Attacking Drug Boats: Bending or Breaking the Law?",
    "description": "<p>U.S. attacks on alleged narcotics trafficking boats continue unabated with little apparent concern for near-unanimous legal condemnation. The Trump administration justifies these attacks as an exercise of national self-defense against a non-state group engaged in armed conflict against the United States &#8212; two inherently defective legal assertions. The result is the targeting of drug cartels like Tren de Aragua with missile strikes. This is not bending the law, it is breaking it.And now we know addressing what is inherently a law enforcement threat with wartime authority has led to an emerging scandal over a reported &#8220;double tap&#8221; strike that killed</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/attacking-drug-boats-bending-or-breaking-the-law/\">Attacking Drug Boats: Bending or Breaking the Law?</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/attacking-drug-boats-bending-or-breaking-the-law/",
    "publishedAt": "Wed, 03 Dec 2025 08:15:05 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "U.S. attacks on alleged narcotics trafficking boats continue unabated with little apparent concern for near-unanimous legal condemnation. The Trump administration justifies these attacks as an exercise of national self-defense against a non-state group engaged in armed conflict against the United States — two inherently defective legal assertions. The result is the targeting of drug cartels like Tren de Aragua with missile strikes. This is not bending the law, it is breaking it.And now we know addressing what is inherently a law enforcement threat with wartime authority has led to an emerging scandal over a reported “double tap” strike that killed\nThe post Attacking Drug Boats: Bending or Breaking the Law? appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42232",
    "title": "What Washington Can Do to Address Fentanyl Flows from China",
    "description": "<p>Since 2013, synthetic opioids, such as fentanyl, have driven an enormous crisis in overdose deaths in the United States, along with the other damaging consequences of addiction and the illegal drug trade. China is a major source of fentanyl and fentanyl precursors &#8212; a key challenge in U.S.-Chinese relations. In late 2023, China resumed some cooperation with the United States to reduce the supply of precursors. Earlier this year, the Trump administration imposed specific tariffs on China to pressure Beijing to do more to disrupt the opioid supply chain, and China retaliated with its own tariffs. On Oct. 30, U.S.</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/what-washington-can-do-to-address-fentanyl-flows-from-china/\">What Washington Can Do to Address Fentanyl Flows from China</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/what-washington-can-do-to-address-fentanyl-flows-from-china/",
    "publishedAt": "Tue, 02 Dec 2025 18:45:11 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Since 2013, synthetic opioids, such as fentanyl, have driven an enormous crisis in overdose deaths in the United States, along with the other damaging consequences of addiction and the illegal drug trade. China is a major source of fentanyl and fentanyl precursors — a key challenge in U.S.-Chinese relations. In late 2023, China resumed some cooperation with the United States to reduce the supply of precursors. Earlier this year, the Trump administration imposed specific tariffs on China to pressure Beijing to do more to disrupt the opioid supply chain, and China retaliated with its own tariffs. On Oct. 30, U.S.\nThe post What Washington Can Do to Address Fentanyl Flows from China appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42216",
    "title": "When Defense Becomes Destruction: Austria-Hungary’s Mistake and Ukraine’s Risk",
    "description": "<p>The southeastern Polish city of Przemy&#347;l, with its elegant 19th century Habsburg-era train station, remains one of the principal gateways to war-torn Ukraine. I pass through it regularly on my way to Ukraine, never missing a chance to visit the statue of the good soldier &#352;vejk on one of the town&#8217;s squares. Over a hundred years ago, in the first months of World War I, this at-the-time multinational city in the northeastern corner of the Austro-Hungarian Empire became the center of military operations on the Eastern Front, site of the largest and bloodiest siege of the war, and an illustration</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/when-defense-becomes-destruction-austria-hungarys-mistake-and-ukraines-risk/\">When Defense Becomes Destruction: Austria-Hungary’s Mistake and Ukraine’s Risk</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/12/when-defense-becomes-destruction-austria-hungarys-mistake-and-ukraines-risk/",
    "publishedAt": "Tue, 02 Dec 2025 08:30:32 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "The southeastern Polish city of Przemyśl, with its elegant 19th century Habsburg-era train station, remains one of the principal gateways to war-torn Ukraine. I pass through it regularly on my way to Ukraine, never missing a chance to visit the statue of the good soldier Švejk on one of the town’s squares. Over a hundred years ago, in the first months of World War I, this at-the-time multinational city in the northeastern corner of the Austro-Hungarian Empire became the center of military operations on the Eastern Front, site of the largest and bloodiest siege of the war, and an illustration\nThe post When Defense Becomes Destruction: Austria-Hungary’s Mistake and Ukraine’s Risk appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42207",
    "title": "The 2025 War on the Rocks Holiday Reading List",
    "description": "<p>It wouldn&#8217;t be the holidays without our annual War on the Rocks book roundup. Check off your gift list or pick a book to enjoy by the fire. Happy reading.Kerry AndersonThe Warrior Queens: The Legends and the Lives of the Women Who Have Led Their Nations in War, Antonia Fraser (1990). I&#8217;ll happily read any history book by Antonia Fraser, but this might be my favorite. The book offers multiple mini biographies of warrior queens throughout history, such as Boadicea, Zenobia, the Rani of Jhansi, and several more. Fraser weaves fascinating themes about women, power, and warfare throughout the various</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/the-2025-war-on-the-rocks-holiday-reading-list/\">The 2025 War on the Rocks Holiday Reading List</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/the-2025-war-on-the-rocks-holiday-reading-list/",
    "publishedAt": "Fri, 28 Nov 2025 08:45:28 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "It wouldn’t be the holidays without our annual War on the Rocks book roundup. Check off your gift list or pick a book to enjoy by the fire. Happy reading.Kerry AndersonThe Warrior Queens: The Legends and the Lives of the Women Who Have Led Their Nations in War, Antonia Fraser (1990). I’ll happily read any history book by Antonia Fraser, but this might be my favorite. The book offers multiple mini biographies of warrior queens throughout history, such as Boadicea, Zenobia, the Rani of Jhansi, and several more. Fraser weaves fascinating themes about women, power, and warfare throughout the various\nThe post The 2025 War on the Rocks Holiday Reading List appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42179",
    "title": "A 15-Point Plan to Get to a Ukrainian-Russian Settlement",
    "description": "<p>Editor&#8217;s Note: A Ukrainian language version of this article is available / &#1041;&#1091;&#1076;&#1100; &#1083;&#1072;&#1089;&#1082;&#1072;, &#1079;&#1074;&#1077;&#1088;&#1085;&#1110;&#1090;&#1100; &#1091;&#1074;&#1072;&#1075;&#1091;, &#1097;&#1086; &#1091;&#1082;&#1088;&#1072;&#1111;&#1085;&#1089;&#1100;&#1082;&#1072; &#1074;&#1077;&#1088;&#1089;&#1110;&#1103; &#1094;&#1110;&#1108;&#1111; &#1089;&#1090;&#1072;&#1090;&#1090;&#1110; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;.&#160;I do not know the origins of the Trump administration&#8217;s 28-point peace plan to resolve the Russo-Ukrainian War, but I can safely say it has caused quite a stir in Kyiv, in the capitals of our European military allies, and among American legislators &#8212; including many Senate Republicans who find the document at best risible and at worst a product of Russian authorship.It also contains some oddities: There are references to START I, a treaty that no longer exists</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/a-15-point-plan-to-get-to-a-ukrainian-russian-settlement/\">A 15-Point Plan to Get to a Ukrainian-Russian Settlement</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/a-15-point-plan-to-get-to-a-ukrainian-russian-settlement/",
    "publishedAt": "Tue, 25 Nov 2025 08:30:35 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Editor’s Note: A Ukrainian language version of this article is available / Будь ласка, зверніть увагу, що українська версія цієї статті доступна. I do not know the origins of the Trump administration’s 28-point peace plan to resolve the Russo-Ukrainian War, but I can safely say it has caused quite a stir in Kyiv, in the capitals of our European military allies, and among American legislators — including many Senate Republicans who find the document at best risible and at worst a product of Russian authorship.It also contains some oddities: There are references to START I, a treaty that no longer exists\nThe post A 15-Point Plan to Get to a Ukrainian-Russian Settlement appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42171",
    "title": "A Historic Resolution, an Unworkable Plan: The Uncertain Future of Gaza’s New Mandate",
    "description": "<p>With the authorization of an international administration and stabilization&#160;force for Gaza, U.N. Security Council Resolution 2803 marks a historic endorsement of the U.S.-led plan to reinforce the ceasefire and rebuild the territory after two years of horrific conflict. But volatility on the ground, alongside a lack of clarity over how the resolution aims to overhaul the political and security reality in Gaza, threatens to turn this laudable effort into yet another untenable plan to resolve one of the world&#8217;s most intractable and increasingly destructive conflicts.The U.S.-drafted resolution establishes an important point of international law by authorizing an international administration for</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/a-historic-resolution-an-unworkable-plan-the-uncertain-future-of-gazas-new-mandate/\">A Historic Resolution, an Unworkable Plan: The Uncertain Future of Gaza’s New Mandate</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/a-historic-resolution-an-unworkable-plan-the-uncertain-future-of-gazas-new-mandate/",
    "publishedAt": "Tue, 25 Nov 2025 08:15:38 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "With the authorization of an international administration and stabilization force for Gaza, U.N. Security Council Resolution 2803 marks a historic endorsement of the U.S.-led plan to reinforce the ceasefire and rebuild the territory after two years of horrific conflict. But volatility on the ground, alongside a lack of clarity over how the resolution aims to overhaul the political and security reality in Gaza, threatens to turn this laudable effort into yet another untenable plan to resolve one of the world’s most intractable and increasingly destructive conflicts.The U.S.-drafted resolution establishes an important point of international law by authorizing an international administration for\nThe post A Historic Resolution, an Unworkable Plan: The Uncertain Future of Gaza’s New Mandate appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42136",
    "title": "Chicken Versus Bumper Cars in Conflict Escalation",
    "description": "<p>Iran launched hundreds of drones and missiles at Israel last April &#8212; and the attack might have been designed to fail.The strike was a show of force built for spectacle rather than destruction, revealing a new rung on the escalation ladder where some states can act like they&#8217;re at war without paying the usual price. This is performative aggression &#8212; a game of bumper cars in a world long defined by the more familiar and high-stakes game of chicken. Characterized by limited-damage strikes that capitalize on a defender&#8217;s high-end air defenses and designed to evade escalation, this new kind of</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/chicken-versus-bumper-cars-in-conflict-escalation/\">Chicken Versus Bumper Cars in Conflict Escalation</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/chicken-versus-bumper-cars-in-conflict-escalation/",
    "publishedAt": "Mon, 24 Nov 2025 08:30:20 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Iran launched hundreds of drones and missiles at Israel last April — and the attack might have been designed to fail.The strike was a show of force built for spectacle rather than destruction, revealing a new rung on the escalation ladder where some states can act like they’re at war without paying the usual price. This is performative aggression — a game of bumper cars in a world long defined by the more familiar and high-stakes game of chicken. Characterized by limited-damage strikes that capitalize on a defender’s high-end air defenses and designed to evade escalation, this new kind of\nThe post Chicken Versus Bumper Cars in Conflict Escalation appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36621",
    "title": "The Case for Treating Drones as Ammunition",
    "description": "<p>Ukraine burns through small drones like belts of ammunition &#8212; fed, fired, and reloaded. Piloted from behind the front lines, drones hunt on the battlefield. This summer, Ukraine&#8217;s drone production increased 900 percent to 200,000 per month from 20,000 the previous year. Costs, too, are ammunition-like: reconnaissance and first-person view drones cost in the low thousands, akin to 120mm mortar rounds and far cheaper than a $200,000 Javelin anti-tank missile. Despite limits to drone performance, the United States will certainly need more drones than it has now. Acquiring, maintaining, accounting for, and delivering drones exceeds what the U.S. Army&#8217;s supply</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/the-case-for-treating-drones-as-ammunition/\">The Case for Treating Drones as Ammunition</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/the-case-for-treating-drones-as-ammunition/",
    "publishedAt": "Fri, 21 Nov 2025 08:30:36 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Ukraine burns through small drones like belts of ammunition — fed, fired, and reloaded. Piloted from behind the front lines, drones hunt on the battlefield. This summer, Ukraine’s drone production increased 900 percent to 200,000 per month from 20,000 the previous year. Costs, too, are ammunition-like: reconnaissance and first-person view drones cost in the low thousands, akin to 120mm mortar rounds and far cheaper than a $200,000 Javelin anti-tank missile. Despite limits to drone performance, the United States will certainly need more drones than it has now. Acquiring, maintaining, accounting for, and delivering drones exceeds what the U.S. Army’s supply\nThe post The Case for Treating Drones as Ammunition appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42150",
    "title": "The Last Stand Dilemma in Ukraine",
    "description": "<p>When should Ukraine commit more forces to a perhaps desperate stand to hold ground it will likely lose? And when is it the difficult but correct choice to preserve the force and pull back to the next defensive line? This is the real, agonizing strategic dilemma shaping the war, now highlighted in the fight for Pokrovsk.Distinguished strategist Lawrence Freedman joins Ryan at a cafe in Vilnius, where they were both speaking at a conference, to dissect this critical question. They also sort through how this relates to each side&#8217;s theory of victory and the shifting realities of the battlefield.Image: ArmyInform</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/the-last-stand-dilemma-in-ukraine/\">The Last Stand Dilemma in Ukraine</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/the-last-stand-dilemma-in-ukraine/",
    "publishedAt": "Thu, 20 Nov 2025 19:41:54 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "When should Ukraine commit more forces to a perhaps desperate stand to hold ground it will likely lose? And when is it the difficult but correct choice to preserve the force and pull back to the next defensive line? This is the real, agonizing strategic dilemma shaping the war, now highlighted in the fight for Pokrovsk.Distinguished strategist Lawrence Freedman joins Ryan at a cafe in Vilnius, where they were both speaking at a conference, to dissect this critical question. They also sort through how this relates to each side’s theory of victory and the shifting realities of the battlefield.Image: ArmyInform\nThe post The Last Stand Dilemma in Ukraine appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42114",
    "title": "South Korea’s Flirtation with Nuclear Latency",
    "description": "<p>In 2024, Lami Kim wrote &#8220;South Korea&#8217;s Nuclear Latency Dilemma,&#8221; where she argued that while South Korean attitudes toward nuclear latency were growing more favorable, the United States still disapproved of the move. Since that time, the conversation appears to be moving in a different direction. In light of these changes, we asked Lami to revisit her article.Image: Juanita White via DVIDSIn your 2024 article, &#8220;South Korea&#8217;s Nuclear Latency Dilemma,&#8221; you wrote about the strict nature of the American stance on anti-nuclear latency in South Korea. What geopolitical developments do you believe are the most concerning to South Korea over</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/south-koreas-flirtation-with-nuclear-latency/\">South Korea&#8217;s Flirtation with Nuclear Latency</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/south-koreas-flirtation-with-nuclear-latency/",
    "publishedAt": "Thu, 20 Nov 2025 18:30:19 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "In 2024, Lami Kim wrote “South Korea’s Nuclear Latency Dilemma,” where she argued that while South Korean attitudes toward nuclear latency were growing more favorable, the United States still disapproved of the move. Since that time, the conversation appears to be moving in a different direction. In light of these changes, we asked Lami to revisit her article.Image: Juanita White via DVIDSIn your 2024 article, “South Korea’s Nuclear Latency Dilemma,” you wrote about the strict nature of the American stance on anti-nuclear latency in South Korea. What geopolitical developments do you believe are the most concerning to South Korea over\nThe post South Korea’s Flirtation with Nuclear Latency appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36634",
    "title": "Red Hands in Paris: A Small Act of Vandalism in a Big Russian Strategy",
    "description": "<p>On the afternoon of May 11, 2024, two men arrived at a modest hotel in Paris. One of them, identifying himself as Mircho Angelov, presented a Bulgarian ID card at the reception desk, though the booking had been made days earlier from Bulgaria by another man named Nikolay Ivanov. Over the next 24 hours, Angelov and Georgi Filipov toured the French capital, before being joined the next day by a third man, Kiril Milushev. The three men spent the day of May 13 in caf&#233;s across the Marais district. But that very same night, their activity took a more covert</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/red-hands-in-paris-a-small-act-of-vandalism-in-a-big-russian-strategy/\">Red Hands in Paris: A Small Act of Vandalism in a Big Russian Strategy</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/red-hands-in-paris-a-small-act-of-vandalism-in-a-big-russian-strategy/",
    "publishedAt": "Thu, 20 Nov 2025 08:30:36 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "On the afternoon of May 11, 2024, two men arrived at a modest hotel in Paris. One of them, identifying himself as Mircho Angelov, presented a Bulgarian ID card at the reception desk, though the booking had been made days earlier from Bulgaria by another man named Nikolay Ivanov. Over the next 24 hours, Angelov and Georgi Filipov toured the French capital, before being joined the next day by a third man, Kiril Milushev. The three men spent the day of May 13 in cafés across the Marais district. But that very same night, their activity took a more covert\nThe post Red Hands in Paris: A Small Act of Vandalism in a Big Russian Strategy appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=42127",
    "title": "How the United States Can Address Its Shortage of Missile Interceptors",
    "description": "<p>The United States faces a challenge to maintain adequate stockpiles of missile interceptors amid rising demand and limited production capacity. The strain spans multiple systems. For example, concerns over dwindling Patriot interceptor inventories and the high usage rate of interceptors for the Terminal High Altitude Area Defense (THAAD) system drew attention this summer. The war in Ukraine has also helped drive concerns that U.S. interceptor inventories are insufficient. To better understand the challenge, we asked three experts: What should the United States do to address the shortage in interceptors? Read more below. Ankit Panda Stanton Senior Fellow in the Nuclear</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/how-the-united-states-can-address-its-shortage-of-missile-interceptors/\">How the United States Can Address Its Shortage of Missile Interceptors</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/how-the-united-states-can-address-its-shortage-of-missile-interceptors/",
    "publishedAt": "Wed, 19 Nov 2025 18:30:14 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "The United States faces a challenge to maintain adequate stockpiles of missile interceptors amid rising demand and limited production capacity. The strain spans multiple systems. For example, concerns over dwindling Patriot interceptor inventories and the high usage rate of interceptors for the Terminal High Altitude Area Defense (THAAD) system drew attention this summer. The war in Ukraine has also helped drive concerns that U.S. interceptor inventories are insufficient. To better understand the challenge, we asked three experts: What should the United States do to address the shortage in interceptors? Read more below. Ankit Panda Stanton Senior Fellow in the Nuclear\nThe post How the United States Can Address Its Shortage of Missile Interceptors appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36601",
    "title": "The Hidden Cost of a Missile: Why the Headlines Get Cost Wrong",
    "description": "<p>Since late 2023, the U.S. Navy has fired nearly $1 billion worth of munitions to protect ships in the Red Sea from low-cost Houthi drones and missiles. The headlines that followed have rightly pointed out the absurdity of firing multi-million dollar missiles against cheap drones. But those headlines miss the bigger picture.Behind each intercept lies a vast and expensive ecosystem: the carrier strike group and its escorts, the logistics tail that keeps them fueled, the training pipeline for crews, and the command-and-control networks that make the engagement possible. In reality, the cost of downing each drone is not a few</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/the-hidden-cost-of-a-missile-why-the-headlines-get-cost-wrong/\">The Hidden Cost of a Missile: Why the Headlines Get Cost Wrong</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/the-hidden-cost-of-a-missile-why-the-headlines-get-cost-wrong/",
    "publishedAt": "Tue, 18 Nov 2025 08:30:39 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Since late 2023, the U.S. Navy has fired nearly $1 billion worth of munitions to protect ships in the Red Sea from low-cost Houthi drones and missiles. The headlines that followed have rightly pointed out the absurdity of firing multi-million dollar missiles against cheap drones. But those headlines miss the bigger picture.Behind each intercept lies a vast and expensive ecosystem: the carrier strike group and its escorts, the logistics tail that keeps them fueled, the training pipeline for crews, and the command-and-control networks that make the engagement possible. In reality, the cost of downing each drone is not a few\nThe post The Hidden Cost of a Missile: Why the Headlines Get Cost Wrong appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36645",
    "title": "Saudi Nuclear Posture After the 12-Day War",
    "description": "<p>Israel&#8217;s short but destructive summer war against Iran and its brazen military strikes on Doha in September have reignited a debate across the Middle East over the value of nuclear deterrence. Gulf states also now worry that Israel&#8217;s aggression could push the Iranian leadership to finally make the leap to a bomb in order to prevent regime change.Saudi Arabia has long desired to match the military and nuclear capabilities of its regional rivals &#8212; Iran and Israel. In the aftermath of the 12-Day War it now seems to be doubling down on a policy of nuclear ambiguity. The United States</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/saudi-nuclear-posture-after-the-12-day-war/\">Saudi Nuclear Posture After the 12-Day War</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/saudi-nuclear-posture-after-the-12-day-war/",
    "publishedAt": "Fri, 14 Nov 2025 08:30:42 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Israel’s short but destructive summer war against Iran and its brazen military strikes on Doha in September have reignited a debate across the Middle East over the value of nuclear deterrence. Gulf states also now worry that Israel’s aggression could push the Iranian leadership to finally make the leap to a bomb in order to prevent regime change.Saudi Arabia has long desired to match the military and nuclear capabilities of its regional rivals — Iran and Israel. In the aftermath of the 12-Day War it now seems to be doubling down on a policy of nuclear ambiguity. The United States\nThe post Saudi Nuclear Posture After the 12-Day War appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36607",
    "title": "Are New Defense Companies Giving Away Sensitive Info Through Marketing?",
    "description": "<p>&#8220;Loose lips sink ships.&#8221; It was catchy, memorable, and above all, true. That wisdom feels incompatible with Silicon Valley&#8217;s culture and business model, yet today&#8217;s national security strategy depends on it. By oversharing, emerging defense companies may be undermining the very deterrence to which they hope to be contributing.For much of the past 30 years, U.S. deterrence was straightforward: reveal to deter and conceal to win. Put simply, the United States had the biggest stick, and just brandishing it was enough. The world is no longer that clear. A peer adversary now matches or surpasses U.S. capacity in key areas.</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/are-new-defense-companies-giving-away-sensitive-info-through-marketing/\">Are New Defense Companies Giving Away Sensitive Info Through Marketing?</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/are-new-defense-companies-giving-away-sensitive-info-through-marketing/",
    "publishedAt": "Thu, 13 Nov 2025 09:00:15 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "“Loose lips sink ships.” It was catchy, memorable, and above all, true. That wisdom feels incompatible with Silicon Valley’s culture and business model, yet today’s national security strategy depends on it. By oversharing, emerging defense companies may be undermining the very deterrence to which they hope to be contributing.For much of the past 30 years, U.S. deterrence was straightforward: reveal to deter and conceal to win. Put simply, the United States had the biggest stick, and just brandishing it was enough. The world is no longer that clear. A peer adversary now matches or surpasses U.S. capacity in key areas.\nThe post Are New Defense Companies Giving Away Sensitive Info Through Marketing? appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36568",
    "title": "Ghosts of the Road: What the Failed War on IEDs Means for Drones",
    "description": "<p>The United States lost the war against a weapon that almost everyone knows by its acronym: the IED or improvised explosive device. Despite technological innovation, training, and tactical brilliance, attacks persisted. Tactical adaptations failed to prevent strategic defeat. IED components remained cheap and ubiquitous. Manufacturing knowledge spread faster than defenses could adapt. Most critically, the countermeasures never managed to close the risk-cost imbalance. Each new or improved defensive kit pushed the United States deeper into a cost trap.Listening to today&#8217;s military and industry discussions on counter-drone strategies, it feels like d&#233;j&#224; vu. As the Army&#8217;s chief technology officer warned in</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/ghosts-of-the-road-what-the-failed-war-on-ieds-means-for-drones/\">Ghosts of the Road: What the Failed War on IEDs Means for Drones</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/ghosts-of-the-road-what-the-failed-war-on-ieds-means-for-drones/",
    "publishedAt": "Wed, 12 Nov 2025 08:30:45 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "The United States lost the war against a weapon that almost everyone knows by its acronym: the IED or improvised explosive device. Despite technological innovation, training, and tactical brilliance, attacks persisted. Tactical adaptations failed to prevent strategic defeat. IED components remained cheap and ubiquitous. Manufacturing knowledge spread faster than defenses could adapt. Most critically, the countermeasures never managed to close the risk-cost imbalance. Each new or improved defensive kit pushed the United States deeper into a cost trap.Listening to today’s military and industry discussions on counter-drone strategies, it feels like déjà vu. As the Army’s chief technology officer warned in\nThe post Ghosts of the Road: What the Failed War on IEDs Means for Drones appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36579",
    "title": "How South Korea Can Help the U.S. Navy Stay Afloat in the Pacific",
    "description": "<p>Can America deter China if its warships are stuck in port? Probably not. And the problem is made worse by chronic shipbuilding delays. This means the U.S. Navy is forced to rely more heavily on its legacy fleet, which requires more maintenance. And neither the Navy&#8217;s domestic shipyards nor its overseas facilities can meet current demand. Without immediate action, the Navy risks missing force design and operational readiness goals in critical regions like the Indo-Pacific.Aware of the risk, Defense Secretary Pete Hegseth recently announced plans to expand maintenance, repair, and overhaul activities in South Korean shipyards. From a purely economic</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/how-south-korea-can-help-the-u-s-navy-stay-afloat-in-the-pacific/\">How South Korea Can Help the U.S. Navy Stay Afloat in the Pacific</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/how-south-korea-can-help-the-u-s-navy-stay-afloat-in-the-pacific/",
    "publishedAt": "Wed, 12 Nov 2025 08:30:12 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Can America deter China if its warships are stuck in port? Probably not. And the problem is made worse by chronic shipbuilding delays. This means the U.S. Navy is forced to rely more heavily on its legacy fleet, which requires more maintenance. And neither the Navy’s domestic shipyards nor its overseas facilities can meet current demand. Without immediate action, the Navy risks missing force design and operational readiness goals in critical regions like the Indo-Pacific.Aware of the risk, Defense Secretary Pete Hegseth recently announced plans to expand maintenance, repair, and overhaul activities in South Korean shipyards. From a purely economic\nThe post How South Korea Can Help the U.S. Navy Stay Afloat in the Pacific appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36517",
    "title": "Without a Standard for Autonomy, the U.S. Military Will Get Lost in the Fog of War",
    "description": "<p>Popular culture often distorts autonomy into science fiction caricatures. This framing obscures the real challenges and opportunities facing the U.S. military: autonomy as a layered, incremental capability, always shaped by mission context.Ukraine&#8217;s &#8220;Operation Spiderweb,&#8221; in which over a hundred drones conducted a coordinated, semi-autonomous attack, illustrates this reality. Operators tasked and launched the systems, but autonomy enabled distributed navigation, deconfliction, and timing. It wasn&#8217;t a leap to science fiction. It was a practical demonstration of how autonomy can multiply effects and impose asymmetric costs.For the Pentagon to realize a commercial-first and more autonomous force, it must overcome a lack of</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/without-a-standard-for-autonomy-the-u-s-military-will-get-lost-in-the-fog-of-war/\">Without a Standard for Autonomy, the U.S. Military Will Get Lost in the Fog of War</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/without-a-standard-for-autonomy-the-u-s-military-will-get-lost-in-the-fog-of-war/",
    "publishedAt": "Mon, 10 Nov 2025 09:00:15 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Popular culture often distorts autonomy into science fiction caricatures. This framing obscures the real challenges and opportunities facing the U.S. military: autonomy as a layered, incremental capability, always shaped by mission context.Ukraine’s “Operation Spiderweb,” in which over a hundred drones conducted a coordinated, semi-autonomous attack, illustrates this reality. Operators tasked and launched the systems, but autonomy enabled distributed navigation, deconfliction, and timing. It wasn’t a leap to science fiction. It was a practical demonstration of how autonomy can multiply effects and impose asymmetric costs.For the Pentagon to realize a commercial-first and more autonomous force, it must overcome a lack of\nThe post Without a Standard for Autonomy, the U.S. Military Will Get Lost in the Fog of War appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36557",
    "title": "Make the Pentagon’s China Report Really Matter",
    "description": "<p>If past is prologue, the Pentagon will soon release its annual report on Military and Security Developments Involving the People&#8217;s Republic of China. Commonly known as the China military power report, this publication is more than just another report from the Department of Defense. It plays a vital role in the public&#8217;s awareness of the world&#8217;s largest military build-up since World War II, which Beijing often shrouds in opacity.&#160;&#160;In 1999, Congress required the department to provide a yearly report on China&#8217;s &#8220;current and future military strategy.&#8221; The first edition, released in 2000, spanned just 23 pages. Last year&#8217;s report was</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/make-the-pentagons-china-report-really-matter/\">Make the Pentagon’s China Report Really Matter</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/make-the-pentagons-china-report-really-matter/",
    "publishedAt": "Mon, 10 Nov 2025 08:15:05 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "If past is prologue, the Pentagon will soon release its annual report on Military and Security Developments Involving the People’s Republic of China. Commonly known as the China military power report, this publication is more than just another report from the Department of Defense. It plays a vital role in the public’s awareness of the world’s largest military build-up since World War II, which Beijing often shrouds in opacity.  In 1999, Congress required the department to provide a yearly report on China’s “current and future military strategy.” The first edition, released in 2000, spanned just 23 pages. Last year’s report was\nThe post Make the Pentagon’s China Report Really Matter appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36485",
    "title": "America Should Build Its Own Warships While Buying Tankers",
    "description": "<p>Shipbuilding is having a moment in Washington. That&#8217;s great, but hype doesn&#8217;t float boats.Reshoring commercial shipbuilding is billed as the key to maritime security. Proponents claim benefits to naval shipbuilding, sealift capacity, and a hedge against China &#8212; builder of over half the world&#8217;s commercial vessels &#8212; wielding its merchant tonnage for coercion.The United States does need to build more ships &#8212; and fast &#8212; to meet China&#8217;s challenges. But throwing dollars at commercial tonnage won&#8217;t get it the boats that matter most in a fight: apex submarines, unmanned vessels, and other advanced naval systems. Efforts within the White House</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/america-should-build-its-own-warships-while-buying-tankers/\">America Should Build Its Own Warships While Buying Tankers</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/america-should-build-its-own-warships-while-buying-tankers/",
    "publishedAt": "Wed, 05 Nov 2025 09:00:02 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Shipbuilding is having a moment in Washington. That’s great, but hype doesn’t float boats.Reshoring commercial shipbuilding is billed as the key to maritime security. Proponents claim benefits to naval shipbuilding, sealift capacity, and a hedge against China — builder of over half the world’s commercial vessels — wielding its merchant tonnage for coercion.The United States does need to build more ships — and fast — to meet China’s challenges. But throwing dollars at commercial tonnage won’t get it the boats that matter most in a fight: apex submarines, unmanned vessels, and other advanced naval systems. Efforts within the White House\nThe post America Should Build Its Own Warships While Buying Tankers appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36524",
    "title": "Racing Against Time: Realizing a True Defense Industrial Enterprise",
    "description": "<p>Editor&#8217;s Note: The topics covered in this article were discussed further in a recent episode of the War on the Rocks podcast with Gen. (ret.) Brown, Jr. Listen here.In November 2015, I was five months into commanding the air campaign against the self-proclaimed Islamic State. Operation Inherent Resolve was in full swing. Coalition airpower was blocking enemy reinforcements, severing supply lines, choking off illicit oil revenue, and enabling friendly forces to retake key ground. We were taking it to the enemy: The week before Thanksgiving 2015, U.S. Central Command registered the highest seven-day total weapons expenditure since the beginning of</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/racing-against-time-realizing-a-true-defense-industrial-enterprise/\">Racing Against Time: Realizing a True Defense Industrial Enterprise</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/racing-against-time-realizing-a-true-defense-industrial-enterprise/",
    "publishedAt": "Wed, 05 Nov 2025 08:30:36 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Editor’s Note: The topics covered in this article were discussed further in a recent episode of the War on the Rocks podcast with Gen. (ret.) Brown, Jr. Listen here.In November 2015, I was five months into commanding the air campaign against the self-proclaimed Islamic State. Operation Inherent Resolve was in full swing. Coalition airpower was blocking enemy reinforcements, severing supply lines, choking off illicit oil revenue, and enabling friendly forces to retake key ground. We were taking it to the enemy: The week before Thanksgiving 2015, U.S. Central Command registered the highest seven-day total weapons expenditure since the beginning of\nThe post Racing Against Time: Realizing a True Defense Industrial Enterprise appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36473",
    "title": "Warfighters, Not Engineers, Decide What AI Can Be Trusted",
    "description": "<p>Editor&#8217;s Note: This is the second in a series exploring key AI policy choices faced by the Department of Defense and Congress. Please also read the first: &#8220;Four AI Policy Choices Policymakers Can&#8217;t Afford to Get Wrong.&#8221;If you ask almost anyone who has ever tried to get a new capability into the hands of the U.S. military what they think of the acquisition process, you&#8217;ll get a consistent answer: It&#8217;s broken.It&#8217;s not broken because the people inside it are malicious, stupid, or incompetent. And it&#8217;s certainly not because it&#8217;s a system that lacks rigor. It&#8217;s broken because it&#8217;s slow, cumbersome,</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/warfighters-not-engineers-decide-what-ai-can-be-trusted/\">Warfighters, Not Engineers, Decide What AI Can Be Trusted</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/warfighters-not-engineers-decide-what-ai-can-be-trusted/",
    "publishedAt": "Tue, 04 Nov 2025 09:00:16 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Editor’s Note: This is the second in a series exploring key AI policy choices faced by the Department of Defense and Congress. Please also read the first: “Four AI Policy Choices Policymakers Can’t Afford to Get Wrong.”If you ask almost anyone who has ever tried to get a new capability into the hands of the U.S. military what they think of the acquisition process, you’ll get a consistent answer: It’s broken.It’s not broken because the people inside it are malicious, stupid, or incompetent. And it’s certainly not because it’s a system that lacks rigor. It’s broken because it’s slow, cumbersome,\nThe post Warfighters, Not Engineers, Decide What AI Can Be Trusted appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36434",
    "title": "Attack Helicopters Must Hunt the Hunters",
    "description": "<p>&#8220;Bingo&#8221; means the point of no return: the call that fuel is running dry and the mission is over. The same call now threatens the attack helicopter itself.Army aviators face an existential crisis. They must find a meaningful role on the sensor-saturated modern battlefield or retire from combat entirely. The threat is not being shot down &#8212; it&#8217;s being benched.The problem is simple: American helicopters cannot operate where enemy air defenses remain intact. Mission planners treat functioning surface-to-air missiles as automatic grounds for cancellation. This creates a crippling dependency. The Army waits for the Air Force and Navy to clear</p>\n<p>The post <a href=\"https://warontherocks.com/2025/11/attack-helicopters-must-hunt-the-hunters/\">Attack Helicopters Must Hunt the Hunters</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/11/attack-helicopters-must-hunt-the-hunters/",
    "publishedAt": "Mon, 03 Nov 2025 08:30:27 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "“Bingo” means the point of no return: the call that fuel is running dry and the mission is over. The same call now threatens the attack helicopter itself.Army aviators face an existential crisis. They must find a meaningful role on the sensor-saturated modern battlefield or retire from combat entirely. The threat is not being shot down — it’s being benched.The problem is simple: American helicopters cannot operate where enemy air defenses remain intact. Mission planners treat functioning surface-to-air missiles as automatic grounds for cancellation. This creates a crippling dependency. The Army waits for the Air Force and Navy to clear\nThe post Attack Helicopters Must Hunt the Hunters appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36439",
    "title": "Optimism for Gaza Is Based on Shaky Assumptions",
    "description": "<p>U.S. President Donald Trump&#8217;s 20-point peace plan clearly envisions that Palestinians should continue living in Gaza and that &#8220;Israel will not occupy or annex Gaza.&#8221; Most of the plan clashes with the goals of the far-right members of Israel&#8217;s current ruling coalition, who seek permanent Israeli control of Gaza as part of a &#8220;Greater Israel.&#8221; However, their vision of a future Gaza in which Israelis replace Palestinians remains very much alive.Much of the analysis among think tanks and media in the United States, Europe, Israel, and Arab states has focused on the challenges and potential opportunities for moving beyond the</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/optimism-for-gaza-is-based-on-shaky-assumptions/\">Optimism for Gaza Is Based on Shaky Assumptions</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/optimism-for-gaza-is-based-on-shaky-assumptions/",
    "publishedAt": "Fri, 31 Oct 2025 07:30:50 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "U.S. President Donald Trump’s 20-point peace plan clearly envisions that Palestinians should continue living in Gaza and that “Israel will not occupy or annex Gaza.” Most of the plan clashes with the goals of the far-right members of Israel’s current ruling coalition, who seek permanent Israeli control of Gaza as part of a “Greater Israel.” However, their vision of a future Gaza in which Israelis replace Palestinians remains very much alive.Much of the analysis among think tanks and media in the United States, Europe, Israel, and Arab states has focused on the challenges and potential opportunities for moving beyond the\nThe post Optimism for Gaza Is Based on Shaky Assumptions appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36389",
    "title": "The American Military Officer After Liberalism",
    "description": "<p>Across academia, government, and Silicon Valley, on social media, and in leading journals, intellectuals and political leaders are openly debating what comes after liberalism. Yet inside the military profession, this conversation is either ignored or waved away with half-measures, critiques of Samuel P. Huntington, and calls for more civil-military engagement. What&#8217;s missing is a serious reckoning with how a post-liberal political order, should one ever arise, could reshape the military profession itself.By liberalism, I mean here both the broad Enlightenment &#8220;classical liberalism&#8221; of individual rights and limited democratic government, and its late-20th-century &#8220;progressive&#8221; form dominated by bureaucratic proceduralism. Post-liberalism in</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/the-american-military-officer-after-liberalism/\">The American Military Officer After Liberalism</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/the-american-military-officer-after-liberalism/",
    "publishedAt": "Thu, 30 Oct 2025 07:30:27 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Across academia, government, and Silicon Valley, on social media, and in leading journals, intellectuals and political leaders are openly debating what comes after liberalism. Yet inside the military profession, this conversation is either ignored or waved away with half-measures, critiques of Samuel P. Huntington, and calls for more civil-military engagement. What’s missing is a serious reckoning with how a post-liberal political order, should one ever arise, could reshape the military profession itself.By liberalism, I mean here both the broad Enlightenment “classical liberalism” of individual rights and limited democratic government, and its late-20th-century “progressive” form dominated by bureaucratic proceduralism. Post-liberalism in\nThe post The American Military Officer After Liberalism appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36406",
    "title": "Will Israel’s Algorithmic Counter-Insurgency Proliferate to the West?",
    "description": "<p>Israel&#8217;s recent campaign in Gaza marks a turning point in modern warfare: the fusion of counter-insurgency and artificial intelligence. Will Western states, with different traditions of counter-insurgency that emphasize legitimacy and population control, be influenced by Israel&#8217;s algorithmic model? This question carries high stakes. If Israel&#8217;s approach, which is characterized by automation, scale, and attrition, becomes a template for liberal democracies, it could normalize a form of warfare that values computational efficiency over human judgment.To answer this question, it is important to understand how Israel has approached countering militant groups and how the war that followed the Oct. 7, 2023</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/will-israels-algorithmic-counter-insurgency-proliferate-to-the-west/\">Will Israel’s Algorithmic Counter-Insurgency Proliferate to the West?</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/will-israels-algorithmic-counter-insurgency-proliferate-to-the-west/",
    "publishedAt": "Wed, 29 Oct 2025 07:30:19 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Israel’s recent campaign in Gaza marks a turning point in modern warfare: the fusion of counter-insurgency and artificial intelligence. Will Western states, with different traditions of counter-insurgency that emphasize legitimacy and population control, be influenced by Israel’s algorithmic model? This question carries high stakes. If Israel’s approach, which is characterized by automation, scale, and attrition, becomes a template for liberal democracies, it could normalize a form of warfare that values computational efficiency over human judgment.To answer this question, it is important to understand how Israel has approached countering militant groups and how the war that followed the Oct. 7, 2023\nThe post Will Israel’s Algorithmic Counter-Insurgency Proliferate to the West? appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36408",
    "title": "The Global Reach of the War in Ukraine",
    "description": "<p>Since Russia launched its full-scale invasion of Ukraine in February 2022, the war has had ripple effects around the world. We asked five experts to assess how the war has affected key regions beyond Europe &#8212; from East Asia to the Middle East and Africa to Latin America.Read more below.Sergey Radchenko Wilson E. Schmidt Distinguished Professor at the Johns Hopkins School of Advanced International StudiesWhile Russia&#8217;s invasion of Ukraine has deepened Moscow&#8217;s ties with China,&#160;many of the underlying trends have been in evidence for the better part of the last three decades.&#160;Both powers share dissatisfaction with the U.S.-led global order,</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/the-global-reach-of-the-war-in-ukraine/\">The Global Reach of the War in Ukraine</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/the-global-reach-of-the-war-in-ukraine/",
    "publishedAt": "Tue, 28 Oct 2025 17:30:31 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Since Russia launched its full-scale invasion of Ukraine in February 2022, the war has had ripple effects around the world. We asked five experts to assess how the war has affected key regions beyond Europe — from East Asia to the Middle East and Africa to Latin America.Read more below.Sergey Radchenko Wilson E. Schmidt Distinguished Professor at the Johns Hopkins School of Advanced International StudiesWhile Russia’s invasion of Ukraine has deepened Moscow’s ties with China, many of the underlying trends have been in evidence for the better part of the last three decades. Both powers share dissatisfaction with the U.S.-led global order,\nThe post The Global Reach of the War in Ukraine appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36404",
    "title": "How the Army Wants to Counter Drones",
    "description": "<p>Army Chief Technology Officer Alex Miller joined Ryan at a live event&#160;to talk about what countering improvised explosive devices taught him about defeating drones, what the Army is learning from the southern border about emerging threats, and what he wants to see from industry. He makes the case for deeper collaboration between companies, sharper focus,&#160;and the courage to shut down what no longer works.Image: Midjourney</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/how-the-army-wants-to-counter-drones/\">How the Army Wants to Counter Drones</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/how-the-army-wants-to-counter-drones/",
    "publishedAt": "Tue, 28 Oct 2025 12:20:48 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Army Chief Technology Officer Alex Miller joined Ryan at a live event to talk about what countering improvised explosive devices taught him about defeating drones, what the Army is learning from the southern border about emerging threats, and what he wants to see from industry. He makes the case for deeper collaboration between companies, sharper focus, and the courage to shut down what no longer works.Image: Midjourney\nThe post How the Army Wants to Counter Drones appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36359",
    "title": "How Regional Actors Might Respond to a U.S.-Venezuelan War",
    "description": "<p>In recent weeks, the Trump administration has openly ratcheted up threats against Venezuela. It has surged military aircraft and warships to the Caribbean, and U.S. forces have attacked at least seven boats near Venezuela. The Trump administration says that it is targeting drug traffickers and has accused Venezuelan President Nicolas Maduro of working with cartels that ship drugs and immigrants to the United States. President Donald Trump recently suggested that the United States would soon shift the fight against Venezuela from the sea to the land, and he said that he authorized the CIA to carry out covert operations in</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/how-regional-actors-might-respond-to-a-u-s-venezuelan-war/\">How Regional Actors Might Respond to a U.S.-Venezuelan War</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/how-regional-actors-might-respond-to-a-u-s-venezuelan-war/",
    "publishedAt": "Thu, 23 Oct 2025 17:30:24 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "In recent weeks, the Trump administration has openly ratcheted up threats against Venezuela. It has surged military aircraft and warships to the Caribbean, and U.S. forces have attacked at least seven boats near Venezuela. The Trump administration says that it is targeting drug traffickers and has accused Venezuelan President Nicolas Maduro of working with cartels that ship drugs and immigrants to the United States. President Donald Trump recently suggested that the United States would soon shift the fight against Venezuela from the sea to the land, and he said that he authorized the CIA to carry out covert operations in\nThe post How Regional Actors Might Respond to a U.S.-Venezuelan War appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36340",
    "title": "Missiles and the Math of Modern Warfare",
    "description": "<p>When it comes to missiles, America lacks the magazine depth for a long fight, especially against a peer competitor like China. A major part of the problem: traditional U.S. missiles are simply too costly to produce at scale. Ryan sits down with three industry leaders working to change that. Listen to Ethan Thornton (Mach Industries), Sean Pitt (Castelion), and Steve Milano (Anduril) as they explain how they aim to produce different kinds of missiles at scale at costs orders of magnitude lower than the primes. Can they deliver? Image: Midjourney</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/missiles-and-the-math-of-modern-warfare/\">Missiles and the Math of Modern Warfare</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/missiles-and-the-math-of-modern-warfare/",
    "publishedAt": "Thu, 23 Oct 2025 08:00:58 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "When it comes to missiles, America lacks the magazine depth for a long fight, especially against a peer competitor like China. A major part of the problem: traditional U.S. missiles are simply too costly to produce at scale. Ryan sits down with three industry leaders working to change that. Listen to Ethan Thornton (Mach Industries), Sean Pitt (Castelion), and Steve Milano (Anduril) as they explain how they aim to produce different kinds of missiles at scale at costs orders of magnitude lower than the primes. Can they deliver? Image: Midjourney\nThe post Missiles and the Math of Modern Warfare appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36345",
    "title": "A Guide to Collaborating With AI in the Military Classroom",
    "description": "<p>If educators do not learn to embrace AI, they risk being left behind. Yet the question before professional military education institutions is not whether they should embrace this new technology, but how to do so in a way that prepares their students for the future. As educators examine the road ahead, they must find a way to incorporate AI into professional military education without undermining the intellectual development that is the cornerstone of their mission. I&#8217;m concerned that some academics, however well-meaning, are advocating a path that will not prepare students for the future and may leave the United States</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/a-guide-to-collaborating-with-and-not-surrendering-to-ai-in-the-military-classroom/\">A Guide to Collaborating With AI in the Military Classroom</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/a-guide-to-collaborating-with-and-not-surrendering-to-ai-in-the-military-classroom/",
    "publishedAt": "Thu, 23 Oct 2025 07:30:47 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "If educators do not learn to embrace AI, they risk being left behind. Yet the question before professional military education institutions is not whether they should embrace this new technology, but how to do so in a way that prepares their students for the future. As educators examine the road ahead, they must find a way to incorporate AI into professional military education without undermining the intellectual development that is the cornerstone of their mission. I’m concerned that some academics, however well-meaning, are advocating a path that will not prepare students for the future and may leave the United States\nThe post A Guide to Collaborating With AI in the Military Classroom appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36333",
    "title": "What the Military Does",
    "description": "<p>What struck me most was the pain in his eyes. Not the kind of pain that announces itself with dramatics, but the slower variety that settles into the contours of a face and refuses to leave. A countenance of struggle, though that makes it sound more noble than I remember it. This was the look of someone who&#8217;d told this story before, probably many times, each telling an attempt to persuade someone who refused to believe.Whether those rehearsals had been to other pilots over beers, or in his head during the long stretches between missions, or in front of a</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/what-the-military-does/\">What the Military Does</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/what-the-military-does/",
    "publishedAt": "Wed, 22 Oct 2025 07:40:11 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "What struck me most was the pain in his eyes. Not the kind of pain that announces itself with dramatics, but the slower variety that settles into the contours of a face and refuses to leave. A countenance of struggle, though that makes it sound more noble than I remember it. This was the look of someone who’d told this story before, probably many times, each telling an attempt to persuade someone who refused to believe.Whether those rehearsals had been to other pilots over beers, or in his head during the long stretches between missions, or in front of a\nThe post What the Military Does appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36292",
    "title": "The Air Force is Kneecapping Software Innovation",
    "description": "<p>Editor&#8217;s Note: Following publication of this article, the Department of the Air Force chief information officer responded to this article on LinkedIn, providing further justification for their memo. They announced their intention to rescind and revise the current memo for clarity, with a new version to follow in the coming weeks.The Department of the Air Force chief information officer announced a new policy change by sharing a post from a contractor, with the tag, &#8220;Strategic shift, operational clarity.&#8221;It is neither.The Fiscal Year 2018 National Defense Authorization Act directed the secretary of defense to task the Defense Innovation Board &#8220;to undertake</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/the-air-force-is-kneecapping-software-innovation/\">The Air Force is Kneecapping Software Innovation</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/the-air-force-is-kneecapping-software-innovation/",
    "publishedAt": "Tue, 21 Oct 2025 08:00:22 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Editor’s Note: Following publication of this article, the Department of the Air Force chief information officer responded to this article on LinkedIn, providing further justification for their memo. They announced their intention to rescind and revise the current memo for clarity, with a new version to follow in the coming weeks.The Department of the Air Force chief information officer announced a new policy change by sharing a post from a contractor, with the tag, “Strategic shift, operational clarity.”It is neither.The Fiscal Year 2018 National Defense Authorization Act directed the secretary of defense to task the Defense Innovation Board “to undertake\nThe post The Air Force is Kneecapping Software Innovation appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36268",
    "title": "No Cause for Alarm: The Case for a Measured Response to Russian Air Incursions",
    "description": "<p>Over the past month, eyes across Europe have been trained on the sky.On Sep. 10, about 20 Gerbera surveillance drones, believed to have been launched from Russia, crossed into Polish airspace. Some were shot down by NATO fighter jets, others crashed after running out of steam. Four days later, another errant drone was detected and tracked, this time over Romania, before it turned around and returned to Ukraine. The following week, three Russian fighter jets entered Estonian airspace over the Gulf of Finland where they remained for 12 minutes before being intercepted by NATO aircraft. The three incidents, coming in</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/no-cause-for-alarm-the-case-for-a-measured-response-to-russian-air-incursions/\">No Cause for Alarm: The Case for a Measured Response to Russian Air Incursions</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/no-cause-for-alarm-the-case-for-a-measured-response-to-russian-air-incursions/",
    "publishedAt": "Mon, 20 Oct 2025 07:30:18 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Over the past month, eyes across Europe have been trained on the sky.On Sep. 10, about 20 Gerbera surveillance drones, believed to have been launched from Russia, crossed into Polish airspace. Some were shot down by NATO fighter jets, others crashed after running out of steam. Four days later, another errant drone was detected and tracked, this time over Romania, before it turned around and returned to Ukraine. The following week, three Russian fighter jets entered Estonian airspace over the Gulf of Finland where they remained for 12 minutes before being intercepted by NATO aircraft. The three incidents, coming in\nThe post No Cause for Alarm: The Case for a Measured Response to Russian Air Incursions appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36262",
    "title": "Does Russian Deterrence Begin in Poland?",
    "description": "<p>In 2018, Alexander Lanoszka and Michael Hunzeker wrote &#8220;The Case for a Permanent U.S. Military Presence in Poland,&#8221; where they argued that a permanent base in Poland would serve as a deterrent for further Russian aggression in the European theater. Seven years later, we asked them to revisit their arguments.Image:&#160;U.S. Army Spc. Aaron GoodIn your 2018 article, &#8220;The Case for a Permanent U.S. Military Presence in Poland,&#8221; you argue that a permanent base in Poland would signal to Russia that the United States is committed to long-term defense and deterrence in Poland and the Baltic states. The United States adopted</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/does-russian-deterrence-begin-in-poland/\">Does Russian Deterrence Begin in Poland?</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/does-russian-deterrence-begin-in-poland/",
    "publishedAt": "Wed, 15 Oct 2025 17:30:17 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "In 2018, Alexander Lanoszka and Michael Hunzeker wrote “The Case for a Permanent U.S. Military Presence in Poland,” where they argued that a permanent base in Poland would serve as a deterrent for further Russian aggression in the European theater. Seven years later, we asked them to revisit their arguments.Image: U.S. Army Spc. Aaron GoodIn your 2018 article, “The Case for a Permanent U.S. Military Presence in Poland,” you argue that a permanent base in Poland would signal to Russia that the United States is committed to long-term defense and deterrence in Poland and the Baltic states. The United States adopted\nThe post Does Russian Deterrence Begin in Poland? appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36277",
    "title": "Holding Ground: Ukraine, Russia, and the Politics of Persistence",
    "description": "<p>Michael Kofman and Dara Massicot join Ryan to discuss the state of the front, how Ukraine and Russia are staying in the fight, the possible provision of Tomahawk Land Attack Missiles, contingencies expected and unexpected, the failures of Russian diplomacy, and what the most important developments of the year so far have been.Image: ArmyInform</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/holding-ground-ukraine-russia-and-the-politics-of-persistence/\">Holding Ground: Ukraine, Russia, and the Politics of Persistence</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/holding-ground-ukraine-russia-and-the-politics-of-persistence/",
    "publishedAt": "Wed, 15 Oct 2025 14:32:35 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Michael Kofman and Dara Massicot join Ryan to discuss the state of the front, how Ukraine and Russia are staying in the fight, the possible provision of Tomahawk Land Attack Missiles, contingencies expected and unexpected, the failures of Russian diplomacy, and what the most important developments of the year so far have been.Image: ArmyInform\nThe post Holding Ground: Ukraine, Russia, and the Politics of Persistence appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36234",
    "title": "Two Dangerous Assumptions in U.S. Defense Planning and How to Fix Them",
    "description": "<p>Decades of dominance leaves a mark: It shapes the beliefs and behaviors of a nation and its military. Extended periods of hegemony for a nation, like long-standing market dominance for a business, encourages blind spots for changing markets, technologies, and competitors. Sustained success breeds complacency born of self-satisfaction. Under-examined strategy and policy assumptions are a particular concern for businesses and governments as a longstanding status quo becomes dogmatically locked in as received wisdom.U.S. defense planning suffers from two under-examined assumptions. The first is that U.S. military force posture, capabilities, and capacities will be sufficient to seamlessly transition from deterrence to</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/two-dangerous-assumptions-in-u-s-defense-planning-and-how-to-fix-them/\">Two Dangerous Assumptions in U.S. Defense Planning and How to Fix Them</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/two-dangerous-assumptions-in-u-s-defense-planning-and-how-to-fix-them/",
    "publishedAt": "Wed, 15 Oct 2025 07:30:56 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Decades of dominance leaves a mark: It shapes the beliefs and behaviors of a nation and its military. Extended periods of hegemony for a nation, like long-standing market dominance for a business, encourages blind spots for changing markets, technologies, and competitors. Sustained success breeds complacency born of self-satisfaction. Under-examined strategy and policy assumptions are a particular concern for businesses and governments as a longstanding status quo becomes dogmatically locked in as received wisdom.U.S. defense planning suffers from two under-examined assumptions. The first is that U.S. military force posture, capabilities, and capacities will be sufficient to seamlessly transition from deterrence to\nThe post Two Dangerous Assumptions in U.S. Defense Planning and How to Fix Them appeared first on War on the Rocks."
  },
  {
    "guid": "https://warontherocks.com/?p=36247",
    "title": "How Often Overlooked Non-State Actors Are Using Drones",
    "description": "<p>Non-state actors worldwide are increasingly using drones to strike both state and rival non-state actors. More than 90 percent of these attacks occur in the Middle East and North Africa, where groups such as Hamas and the Houthis have attracted significant attention for their drone capabilities. However, non-state actors in other parts of the world are also developing drones and finding innovative ways of using them in attacks while receiving far less attention. We asked four experts to assess how non-state actors in Asia, Latin America, and Africa are using drones.Richard Horsey Senior Adviser on Myanmar at the International Crisis</p>\n<p>The post <a href=\"https://warontherocks.com/2025/10/in-brief-how-often-overlooked-non-state-actors-are-using-drones/\">How Often Overlooked Non-State Actors Are Using Drones</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n",
    "url": "https://warontherocks.com/2025/10/in-brief-how-often-overlooked-non-state-actors-are-using-drones/",
    "publishedAt": "Tue, 14 Oct 2025 17:30:55 +0000",
    "source": "War on the Rocks",
    "sourceCategory": "Konflikt",
    "category": "konflikt",
    "contentSnippet": "Non-state actors worldwide are increasingly using drones to strike both state and rival non-state actors. More than 90 percent of these attacks occur in the Middle East and North Africa, where groups such as Hamas and the Houthis have attracted significant attention for their drone capabilities. However, non-state actors in other parts of the world are also developing drones and finding innovative ways of using them in attacks while receiving far less attention. We asked four experts to assess how non-state actors in Asia, Latin America, and Africa are using drones.Richard Horsey Senior Adviser on Myanmar at the International Crisis\nThe post How Often Overlooked Non-State Actors Are Using Drones appeared first on War on the Rocks."
  }
]