[
  {
    "region": "East Asia",
    "tension": 9,
    "articleCount": 6,
    "latestUpdate": "Tue, 02 Dec 2025 18:45:11 +0000",
    "location": {
      "lat": 25.03,
      "lon": 121.56,
      "name": "Taiwan/China"
    },
    "headline": "What Washington Can Do to Address Fentanyl Flows from China",
    "description": "<p>Since 2013, synthetic opioids, such as fentanyl, have driven an enormous crisis in overdose deaths in the United States, along with the other damaging consequences of addiction and the illegal drug trade. China is a major source of fentanyl and fentanyl precursors &#8212; a key challenge in U.S.-Chinese relations. In late 2023, China resumed some cooperation with the United States to reduce the supply of precursors. Earlier this year, the Trump administration imposed specific tariffs on China to pressure Beijing to do more to disrupt the opioid supply chain, and China retaliated with its own tariffs. On Oct. 30, U.S.</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/what-washington-can-do-to-address-fentanyl-flows-from-china/\">What Washington Can Do to Address Fentanyl Flows from China</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n"
  },
  {
    "region": "Global",
    "tension": 8.7,
    "articleCount": 15,
    "latestUpdate": "Thu, 04 Dec 2025 08:25:49 +0000",
    "location": {
      "lat": 0,
      "lon": 0,
      "name": "Multiple"
    },
    "headline": "Decades of Lost Potential in Defense Research and Development",
    "description": "<p>America&#8217;s greatest national security threat is an enemy born from and nurtured by the Pentagon: crippling bureaucracy. It starves the oxygen from good ideas, good people, and good technologies while creating ideal conditions for mediocrity to thrive. It has permeated every corner of the system, including the defense-sponsored innovation initiatives &#8212; like the Small Business Innovation Research Program &#8212; that purportedly exist as its counter.In 1982, President Ronald Reagan signed the Small Business Innovation Development Act, creating the Small Business Innovation Research program. Its stated objectives include providing American small businesses with non-dilutive funding for research and development in areas</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/decades-of-lost-potential-in-defense-research-and-development/\">Decades of Lost Potential in Defense Research and Development</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n"
  },
  {
    "region": "Middle East",
    "tension": 8.3,
    "articleCount": 9,
    "latestUpdate": "Fri, 05 Dec 2025 08:30:13 +0000",
    "location": {
      "lat": 31.5,
      "lon": 34.47,
      "name": "Israel/Palestine"
    },
    "headline": "The U.S.-Saudi Reconfiguration Is Real and It No Longer Depends on Israel",
    "description": "<p>Saudi Crown Prince Mohammed bin Salman&#8217;s recent White House visit has crystallized a fundamental shift in U.S.-Saudi relations: Washington no longer has the leverage to demand Saudi normalization with Israel.After the Biden administration distanced itself from Riyadh following the 2018 Jamal Khashoggi killing, Washington has now recalibrated. This was driven not by diplomacy or values alignment but by structural pressures, including the political blowback that Washington has faced for its military and diplomatic support for Israel&#8217;s Gaza campaign, which strained U.S. credibility across the region. Key to these structural pressures were supply-chain vulnerabilities exposed during the COVID-19 pandemic, the shock</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/the-u-s-saudi-reconfiguration-is-real-and-it-no-longer-depends-on-israel/\">The U.S.-Saudi Reconfiguration Is Real and It No Longer Depends on Israel</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n"
  },
  {
    "region": "Eastern Europe",
    "tension": 8,
    "articleCount": 13,
    "latestUpdate": "Mon, 08 Dec 2025 08:30:59 +0000",
    "location": {
      "lat": 48.38,
      "lon": 31.17,
      "name": "Ukraine"
    },
    "headline": "Why Many Underestimated Russia’s Invasion Risk",
    "description": "<p>Why did so many downplay the risk of a Russian full-scale invasion of Ukraine in February 2022 despite mounting indicators, such as troop build-ups, major exercises, and increasingly aggressive rhetoric from Moscow?Even hours before the first strikes, major media outlets argued that an invasion was unlikely, as it seemed to contradict President Vladimir Putin&#8217;s cost-benefit calculus. They assumed he would conclude that the costs of heavy Western sanctions, together with the risk of significant battlefield casualties, outweighed the potential gains.Many analysts and observers underestimated the likelihood of invasion in part because they modeled Russia as a typical state in which</p>\n<p>The post <a href=\"https://warontherocks.com/2025/12/why-many-underestimated-russias-invasion-risk/\">Why Many Underestimated Russia’s Invasion Risk</a> appeared first on <a href=\"https://warontherocks.com\">War on the Rocks</a>.</p>\n"
  }
]